[
  {
    "id": 0,
    "firstName": "Marc",
    "lastName": "WILLIAMS",
    "birthDate": "1985-06-02",
    "placeOfBirth": "Lodon, UK",
    "codingStrengths": "React, Javascript, Java",
    "codingWeaknesses": "PHP, Ruby, C++",
    "image": "/WILLIAMS.jpeg",
    "biggestAchievementsInCoding": "Developed a cutting-edge mobile application that enhances language learning through immersive experiences. The app integrates AI-driven personalized learning paths and has been downloaded over 1 million times worldwide. It has received accolades for its innovative approach to education and has been featured in several tech magazines.",
    "interestingFunFact": "I once backpacked across Southeast Asia for three months, during which I learned to cook traditional dishes from five different countries. This experience not only enriched my culinary skills but also deepened my appreciation for diverse cultures and their unique stories.",
    "matricule": "20147582"
  },
  {
    "id": 1,
    "firstName": "Mohamed",
    "lastName": "Ismael Otban",
    "birthDate": "2003-01-06",
    "placeOfBirth": "Djibouti-Ville, Djibouti",
    "codingStrengths": "React, Javascript, Java",
    "codingWeaknesses": "Assembly, Swift, Angular",
    "image": "/ISMAEL.png",
    "biggestAchievementsInCoding": "Created an innovative full-stack web application that revolutionized student project management at multiple universities in Djibouti. The project took over 500 hours of development time and incorporated advanced features like real-time collaboration, automated grading, and detailed analytics. It was so well-received that it was adopted by the computer science departments of three major universities and is now used by hundreds of students daily. This achievement opened many doors and led to multiple speaking opportunities at academic conferences.",
    "interestingFunFact": "I have a collection of over 100 different types of tea from around the world, and I enjoy hosting tea-tasting events to share the unique flavors and stories behind each variety. This hobby has taught me about the cultural significance of tea in different societies.",
    "matricule": "20231790"
  },
  {
    "id": 2,
    "firstName": "Ahmadou",
    "lastName": "ASTAGRAM",
    "birthDate": "1998-05-15",
    "placeOfBirth": "Dakar, Senegal",
    "codingStrengths": "Python, React, MongoDB",
    "codingWeaknesses": "Rust, Kotlin",
    "image": "/ASTADJAM.png",
    "biggestAchievementsInCoding": "Led the development of a groundbreaking AI-powered healthcare platform that helps doctors diagnose rare diseases. The system processes millions of medical records and research papers to suggest potential diagnoses with 95% accuracy. This project has been implemented in over 50 hospitals across West Africa and has helped save countless lives by enabling early detection of critical conditions. The success of this initiative led to multiple research papers and presentations at international medical technology conferences.",
    "interestingFunFact": "I once spent six months living in a remote village in the Amazon rainforest, where I helped develop a solar-powered communication system for the local community. During this time, I learned three indigenous languages and discovered my passion for combining technology with humanitarian work. This experience fundamentally changed my approach to problem-solving in software development, always considering the human impact first.",
    "matricule": "20231791"
  },
  {
    "id": 3,
    "firstName": "Romain",
    "lastName": "BALZANO",
    "birthDate": "2001-09-23",
    "placeOfBirth": "Nice, France",
    "codingStrengths": "Vue.js, Node.js, SQL",
    "codingWeaknesses": "Scala, Haskell",
    "image": "/BALZANO.png",
    "biggestAchievementsInCoding": "Developed a revolutionary e-commerce platform that uses blockchain technology for secure transactions and supply chain tracking. The platform now serves over 1 million users across Europe and has processed transactions worth more than €100 million. The innovative approach to combining traditional e-commerce with blockchain technology has earned multiple industry awards and has been featured in major tech publications. This project has become a case study in several business schools.",
    "interestingFunFact": "I'm a former professional chess player who has competed in international tournaments. I apply the strategic thinking and pattern recognition skills from chess to my programming work. I've developed several chess-related applications, including an AI chess engine that can compete at master level. This unique combination of chess and programming has led to interesting approaches in algorithm optimization and problem-solving.",
    "matricule": "20191792"
  },
  {
    "id": 4,
    "firstName": "Yahaya",
    "lastName": "BATHILY",
    "birthDate": "2004-03-12",
    "placeOfBirth": "Bamako, Mali",
    "codingStrengths": "Java, Spring Boot, PostgreSQL",
    "codingWeaknesses": "WebAssembly, Elixir",
    "image": "/BATHILY.png",
    "biggestAchievementsInCoding": "Created an award-winning educational technology platform that has transformed how programming is taught in African schools. The platform uses gamification and interactive learning techniques to make coding accessible to students from diverse backgrounds. It has been adopted by over 200 schools across 15 African countries, reaching more than 50,000 students. The project has received funding from major tech companies and has been recognized by UNESCO for its contribution to digital literacy in developing regions.",
    "interestingFunFact": "I started coding at the age of 8 when I built a simple game to help my younger siblings learn mathematics. This early start in programming, combined with my passion for education, has shaped my career focus on educational technology. I've since developed numerous educational games and applications, each inspired by the learning challenges I observed in my own family and community.",
    "matricule": "20231793"
  },
  {
    "id": 5,
    "firstName": "Louiza",
    "lastName": "BELARIF",
    "birthDate": "1999-11-30",
    "placeOfBirth": "Algiers, Algeria",
    "codingStrengths": "Angular, TypeScript, Firebase",
    "codingWeaknesses": "C, Assembly",
    "image": "/BELARIF.png",
    "biggestAchievementsInCoding": "Architected and implemented a cutting-edge smart city management system that revolutionized urban planning and resource management. The system integrates IoT sensors, real-time data analytics, and machine learning to optimize traffic flow, energy consumption, and waste management. Implemented in three major cities, the project has resulted in a 30% reduction in traffic congestion and a 25% decrease in energy consumption. This achievement led to multiple speaking engagements at smart city conferences worldwide.",
    "interestingFunFact": "I'm an accomplished classical pianist who has performed at various international venues. I've found fascinating parallels between musical composition and code architecture, often using musical principles like rhythm, harmony, and structure in my programming work. I've even developed a unique method of teaching programming concepts through musical analogies, which has been particularly effective in helping artists and musicians transition into tech careers.",
    "matricule": "20231794"
  },
  {
    "id": 6,
    "firstName": "Kaoutar",
    "lastName": "BENAMEUR",
    "birthDate": "1997-07-18",
    "placeOfBirth": "Casablanca, Morocco",
    "codingStrengths": "React Native, Redux, GraphQL",
    "codingWeaknesses": "Perl, COBOL",
    "image": "/BENAMEUR.png",
    "biggestAchievementsInCoding": "Developed a groundbreaking mobile application that revolutionized accessibility for visually impaired users. The app uses advanced AI and voice recognition to provide real-time navigation, object recognition, and text reading capabilities. It has been downloaded over 500,000 times and received multiple accessibility awards. The project has been featured in major tech conferences and is now being used as a reference implementation for accessible mobile development.",
    "interestingFunFact": "I'm a certified deep-sea diver who has explored over 50 different dive sites worldwide. This hobby has unexpectedly influenced my approach to software architecture - just as diving requires careful planning, monitoring of multiple systems, and adaptability to changing conditions, so does building complex software systems. I often use diving analogies when explaining technical concepts to non-technical stakeholders.",
    "matricule": "20231795"
  },
  {
    "id": 7,
    "firstName": "Ilyas",
    "lastName": "BENSALEM",
    "birthDate": "2002-04-25",
    "placeOfBirth": "Oran, Algeria",
    "codingStrengths": "C++, Qt, Docker",
    "codingWeaknesses": "Ruby, Dart",
    "image": "/BENSALEM.png",
    "biggestAchievementsInCoding": "Created a high-performance 3D rendering engine that revolutionized architectural visualization. The engine processes complex 3D models in real-time with photorealistic quality, reducing rendering times from hours to seconds. It's now used by over 100 architectural firms worldwide and has been instrumental in winning several major construction projects. The technology has been licensed to major software companies and has generated millions in revenue.",
    "interestingFunFact": "I'm a former national champion in competitive origami, having won multiple awards for my complex mathematical designs. The precision and geometric thinking required in origami directly influences how I approach algorithm design and optimization in my programming work. I've even developed a series of workshops that teach programming concepts through paper folding.",
    "matricule": "20231796"
  },
  {
    "id": 8,
    "firstName": "Thomas",
    "lastName": "BOVY",
    "birthDate": "1996-08-14",
    "placeOfBirth": "Brussels, Belgium",
    "codingStrengths": "PHP, Laravel, MySQL",
    "codingWeaknesses": "Go, R",
    "image": "/BOVY.png",
    "biggestAchievementsInCoding": "Built a revolutionary fintech platform that has transformed microfinance in developing countries. The system uses blockchain and AI to assess creditworthiness without traditional banking history, enabling millions of unbanked individuals to access financial services. The platform has facilitated over $50 million in microloans across 12 countries and maintains a 98% repayment rate. This project has been recognized by the World Bank for its impact on financial inclusion.",
    "interestingFunFact": "I grew up in a circus family and spent my early years performing as an acrobat. This background has given me a unique perspective on problem-solving - just as a complex acrobatic routine requires breaking down difficult moves into manageable steps, I approach complex coding challenges by decomposing them into smaller, manageable components.",
    "matricule": "20231797"
  },
  {
    "id": 9,
    "firstName": "Chaker",
    "lastName": "YAAKOUB",
    "birthDate": "1999-05-19",
    "placeOfBirth": "Beirut, Lebanon",
    "codingStrengths": "Go, Docker, Kubernetes",
    "codingWeaknesses": "Perl, Visual Basic",
    "image": "/CHAKER.png",
    "biggestAchievementsInCoding": "Developed a revolutionary cloud-native platform for autonomous vehicle coordination that has set new standards in the industry. The system processes real-time data from millions of sensors to enable safe autonomous navigation in complex urban environments. It has reduced accident rates by 99% in pilot cities and is being adopted by major automotive manufacturers worldwide. The platform has received multiple patents and has been featured in leading technology publications.",
    "interestingFunFact": "I'm a former Formula 1 race engineer who worked with championship-winning teams. The experience of optimizing complex systems under extreme conditions has profoundly influenced my approach to software performance tuning and real-time systems development. I've applied racing telemetry concepts to create innovative monitoring solutions for distributed systems.",
    "matricule": "20231798"
  },
  {
    "id": 10,
    "firstName": "Anthony",
    "lastName": "COLIN",
    "birthDate": "2000-12-03",
    "placeOfBirth": "Lyon, France",
    "codingStrengths": "Swift, iOS Development, Firebase",
    "codingWeaknesses": "Lua, Fortran",
    "image": "/COLIN.png",
    "biggestAchievementsInCoding": "Developed an innovative augmented reality educational platform that has transformed how medical students learn anatomy. The app provides interactive 3D models of the human body with real-time AR overlay, allowing students to visualize and understand complex anatomical structures. It's now used in over 75 medical schools worldwide and has been credited with improving student performance by 40%. The project won several educational technology awards.",
    "interestingFunFact": "I'm a semi-professional beatboxer who has performed at international competitions. I've found fascinating connections between creating complex beatbox patterns and writing efficient algorithms - both require precise timing, layering of different elements, and the ability to create complex outcomes from simple building blocks. I've even created a music programming language based on beatbox patterns.",
    "matricule": "20231799"
  },
  {
    "id": 11,
    "firstName": "Marie",
    "lastName": "EVEILLE",
    "birthDate": "1994-02-28",
    "placeOfBirth": "Paris, France",
    "codingStrengths": "JavaScript, Express.js, MongoDB",
    "codingWeaknesses": "Julia, Clojure",
    "image": "/EVEILLE.png",
    "biggestAchievementsInCoding": "Created a groundbreaking social impact platform that connects NGOs with volunteers and donors worldwide. The platform uses AI to match skills and resources with project needs, resulting in over 100,000 successful volunteer placements and $20 million in donations facilitated. The system has been particularly crucial during natural disasters, helping coordinate relief efforts across multiple countries.",
    "interestingFunFact": "I'm a certified sommelier who has turned my passion for wine into a unique approach to teaching software architecture. I've developed a popular workshop series that explains complex software design patterns through wine tasting analogies, helping non-technical stakeholders understand technical concepts through familiar sensory experiences.",
    "matricule": "20231800"
  },
  {
    "id": 12,
    "firstName": "Donat",
    "lastName": "FORTINI",
    "birthDate": "2000-06-09",
    "placeOfBirth": "Lome, Togo",
    "codingStrengths": "Python, Django, AWS",
    "codingWeaknesses": "Objective-C, Pascal",
    "image": "/FORTINI.png",
    "biggestAchievementsInCoding": "Architected a revolutionary agricultural technology platform that uses AI and drone imagery to optimize crop yields in arid regions. The system provides real-time analysis of soil conditions, weather patterns, and crop health, increasing yields by up to 300% while reducing water usage by 40%. The platform is now used by over 10,000 farmers across Africa and has received multiple sustainability awards.",
    "interestingFunFact": "I'm a passionate gamer who loves creating mods for popular games. This hobby has helped me develop strong problem-solving skills and creativity in coding. I particularly enjoy optimizing game performance and creating new gameplay mechanics. I've built several popular mods that have been downloaded over 100,000 times and have contributed to open-source gaming projects.",
    "matricule": "20231801"
  },
  {
    "id": 13,
    "firstName": "Thomas",
    "lastName": "GARAU",
    "birthDate": "1997-10-21",
    "placeOfBirth": "Bordeaux, France",
    "codingStrengths": "React, Next.js, TypeScript",
    "codingWeaknesses": "Ada, Prolog",
    "image": "/GARAU.png",
    "biggestAchievementsInCoding": "Led the development of a cutting-edge cybersecurity platform that uses AI to detect and prevent sophisticated cyber attacks in real-time. The system has successfully prevented over $100 million in potential losses from cyber attacks and is now used by major banks and financial institutions worldwide. The project has received multiple industry awards and has been featured in leading cybersecurity publications.",
    "interestingFunFact": "I'm a competitive speedcuber who can solve a Rubik's cube in under 10 seconds. The pattern recognition and algorithmic thinking required in speedcubing directly translates to my programming work, particularly in optimization problems. I've developed several algorithms based on cube-solving techniques that have applications in data processing and path-finding.",
    "matricule": "20231802"
  },
  {
    "id": 14,
    "firstName": "Livia",
    "lastName": "GRAZIETTI",
    "birthDate": "2003-01-17",
    "placeOfBirth": "Marseille, France",
    "codingStrengths": "Kotlin, Android Development, Room",
    "codingWeaknesses": "MATLAB, Lisp",
    "image": "/GRAZIETTI.png",
    "biggestAchievementsInCoding": "Developed a revolutionary mobile app for emergency response coordination that has transformed disaster management. The app uses mesh networking to maintain communication even when traditional networks are down, and has been crucial in coordinating rescue efforts during major natural disasters. It's now the standard emergency response tool in over 30 countries and has helped save thousands of lives.",
    "interestingFunFact": "I'm a passionate rock climber who enjoys exploring new routes and challenges. This hobby has taught me the importance of perseverance and strategic planning, which I apply to my software development projects.",
    "matricule": "20231803"
  },
  {
    "id": 15,
    "firstName": "Yasmine",
    "lastName": "HAMADENE",
    "birthDate": "2003-01-17",
    "placeOfBirth": "Marseille, France",
    "codingStrengths": "Kotlin, Android Development, Room",
    "codingWeaknesses": "MATLAB, Lisp",
    "image": "/HAMADENE.png",
    "biggestAchievementsInCoding": "Developed a revolutionary mobile app for emergency response coordination that has transformed disaster management. The app uses mesh networking to maintain communication even when traditional networks are down, and has been crucial in coordinating rescue efforts during major natural disasters. It's now the standard emergency response tool in over 30 countries and has helped save thousands of lives.",
    "interestingFunFact": "I'm a passionate photographer who enjoys capturing landscapes and wildlife. This hobby has enhanced my attention to detail and creativity, which I bring into my software development work.",
    "matricule": "20231804"
  },
  {
    "id": 16,
    "firstName": "Pouwedeou",
    "lastName": "KILIMOU",
    "birthDate": "2000-06-09",
    "placeOfBirth": "Lome, Togo",
    "codingStrengths": "Python, Django, AWS",
    "codingWeaknesses": "Objective-C, Pascal",
    "image": "/KILIMOU.png",
    "biggestAchievementsInCoding": "Architected a revolutionary agricultural technology platform that uses AI and drone imagery to optimize crop yields in arid regions. The system provides real-time analysis of soil conditions, weather patterns, and crop health, increasing yields by up to 300% while reducing water usage by 40%. The platform is now used by over 10,000 farmers across Africa and has received multiple sustainability awards.",
    "interestingFunFact": "I'm a passionate gamer who loves creating mods for popular games. This hobby has helped me develop strong problem-solving skills and creativity in coding. I particularly enjoy optimizing game performance and creating new gameplay mechanics. I've built several popular mods that have been downloaded over 100,000 times and have contributed to open-source gaming projects.",
    "matricule": "20231805"
  },
  {
    "id": 17,
    "firstName": "Lucas",
    "lastName": "LECULIER",
    "birthDate": "1995-04-05",
    "placeOfBirth": "Toulouse, France",
    "codingStrengths": "C#, .NET, SQL Server",
    "codingWeaknesses": "Erlang, Groovy",
    "image": "/LECULIER.jpg",
    "biggestAchievementsInCoding": "Created an innovative AI-powered legal technology platform that has revolutionized legal research and case analysis. The system processes millions of legal documents to predict case outcomes with 92% accuracy and has reduced research time for legal professionals by 70%. It's now used by over 500 law firms worldwide and has been cited in several landmark court decisions.",
    "interestingFunFact": "I'm a professional magician who performs close-up magic at international events. The principles of misdirection and attention management in magic have influenced how I design user interfaces - understanding how to guide user attention and create seamless experiences. I've even written a book about applying magical principles to UX design.",
    "matricule": "20231806"
  },
  {
    "id": 18,
    "firstName": "Antony",
    "lastName": "MARCHISELLI",
    "birthDate": "1995-04-05",
    "placeOfBirth": "Toulouse, France",
    "codingStrengths": "C#, .NET, SQL Server",
    "codingWeaknesses": "Erlang, Groovy",
    "image": "/MARCHISELLI.png",
    "biggestAchievementsInCoding": "Created an innovative AI-powered legal technology platform that has revolutionized legal research and case analysis. The system processes millions of legal documents to predict case outcomes with 92% accuracy and has reduced research time for legal professionals by 70%. It's now used by over 500 law firms worldwide and has been cited in several landmark court decisions.",
    "interestingFunFact": "I'm a professional magician who performs close-up magic at international events. The principles of misdirection and attention management in magic have influenced how I design user interfaces - understanding how to guide user attention and create seamless experiences. I've even written a book about applying magical principles to UX design.",
    "matricule": "20231807"
  },
  {
    "id": 19,
    "firstName": "Antoine",
    "lastName": "MARESCHAL-BALLE",
    "birthDate": "1995-04-05",
    "placeOfBirth": "Toulouse, France",
    "codingStrengths": "C#, .NET, SQL Server",
    "codingWeaknesses": "Erlang, Groovy",
    "image": "/HAMADENE.png",
    "biggestAchievementsInCoding": "Created an innovative AI-powered legal technology platform that has revolutionized legal research and case analysis. The system processes millions of legal documents to predict case outcomes with 92% accuracy and has reduced research time for legal professionals by 70%. It's now used by over 500 law firms worldwide and has been cited in several landmark court decisions.",
    "interestingFunFact": "I'm a professional magician who performs close-up magic at international events. The principles of misdirection and attention management in magic have influenced how I design user interfaces - understanding how to guide user attention and create seamless experiences. I've even written a book about applying magical principles to UX design.",
    "matricule": "20231808"
  },
  {
    "id": 20,
    "firstName": "Theo",
    "lastName": "PIACENTINI",
    "birthDate": "2001-08-11",
    "placeOfBirth": "Montpellier, France",
    "codingStrengths": "Vue.js, Nuxt.js, PostgreSQL",
    "codingWeaknesses": "F#, Rust",
    "image": "/PIACENTINI.png",
    "biggestAchievementsInCoding": "Built a groundbreaking renewable energy management platform that optimizes power distribution for smart grids. The system uses machine learning to predict energy demand and automatically balance load across multiple renewable sources, reducing energy waste by 45%. The platform now manages power distribution for over 5 million households across Europe and has won multiple environmental innovation awards.",
    "interestingFunFact": "I'm a competitive drone racer who has won several international championships. The experience of programming racing drones has given me unique insights into real-time systems and optimization. I've applied these principles to develop highly efficient real-time processing systems, particularly in IoT applications.",
    "matricule": "20231809"
  },
  {
    "id": 21,
    "firstName": "Vitali",
    "lastName": "RENKAS",
    "birthDate": "1998-12-29",
    "placeOfBirth": "Minsk, Belarus",
    "codingStrengths": "Java, Spring, Hibernate",
    "codingWeaknesses": "Scala, Crystal",
    "image": "/RENKAS.png",
    "biggestAchievementsInCoding": "Developed a revolutionary enterprise-scale microservices platform that transformed legacy monolithic systems for Fortune 500 companies. The platform reduced deployment times by 90% and improved system reliability by 99.99%. It now processes over 1 billion transactions daily and has saved client companies over $50 million in operational costs. The architecture has been widely adopted as an industry standard for large-scale system modernization.",
    "interestingFunFact": "I'm a former chess grandmaster who has competed in international tournaments. The strategic thinking and pattern recognition skills from chess directly influence my approach to system architecture and problem-solving. I've developed several AI algorithms inspired by chess strategies that are now used in predictive analytics systems.",
    "matricule": "20231810"
  },
  {
    "id": 22,
    "firstName": "Pascal",
    "lastName": "VIGNEAU",
    "birthDate": "1996-03-14",
    "placeOfBirth": "Nantes, France",
    "codingStrengths": "Ruby on Rails, PostgreSQL, Redis",
    "codingWeaknesses": "Haskell, Elm",
    "image": "/VIGNEAU.png",
    "biggestAchievementsInCoding": "Created an innovative healthcare platform that revolutionized patient care management in developing countries. The system uses AI to diagnose common illnesses through symptom analysis and provides telemedicine services in remote areas. It has provided healthcare access to over 2 million people in rural areas and reduced diagnostic errors by 75%. The platform has been recognized by WHO as a breakthrough in accessible healthcare.",
    "interestingFunFact": "I'm a professional mountain climber who has scaled six of the world's seven highest peaks. The methodical planning and risk management required in mountaineering has shaped my approach to software development, especially in building robust, fault-tolerant systems. I've written several papers on applying mountaineering principles to project management in software development.",
    "matricule": "20231811"
  },
  {
    "id": 23,
    "firstName": "Paul-antoine",
    "lastName": "VINCIGUERRA",
    "birthDate": "2000-07-22",
    "placeOfBirth": "Ajaccio, France",
    "codingStrengths": "Flutter, Dart, Firebase",
    "codingWeaknesses": "Assembly, COBOL",
    "image": "/VINCIGUERRA.png",
    "biggestAchievementsInCoding": "Pioneered a groundbreaking mobile education platform that has transformed access to quality education in underserved communities. The app uses advanced offline synchronization and adaptive learning algorithms to provide personalized education even in areas with limited connectivity. It has reached over 5 million students across 50 countries and improved academic performance by an average of 60%. The platform has received multiple UNESCO awards for innovation in education.",
    "interestingFunFact": "I'm a professional orchestra conductor who regularly performs with symphonies across Europe. The experience of coordinating complex musical performances has given me unique insights into managing complex software systems and team dynamics. I've developed a novel approach to software architecture based on musical composition principles that has been published in several technical journals.",
    "matricule": "20231812"
  }
]